chat/app/jobs/create_message_job.rb

  def perform(message_id)
    message = ChatApplicationMessage.find(message_id)
    chat = message.chat_application_chat

    ChatApplicationChat.transaction do
      chat.lock!
      chat.increment!(:chat_application_messages_count)
---
SELECT `chat_application_messages`.* FROM `chat_application_messages` WHERE `chat_application_messages`.`id` = 1 LIMIT 1
UPDATE `chat_application_chats` SET `chat_application_chats`.`chat_application_messages_count` = COALESCE(`chat_application_chats`.`chat_application_messages_count`, 0) + 1 WHERE `chat_application_chats`.`id` = 1