chat/app/jobs/create_chat_job.rb

  def perform(chat_id)
    chat = ChatApplicationChat.find(chat_id)
    application = chat.application

    ChatApplication.transaction do
      application.lock!
      application.increment!(:chat_application_chats_count)
---
SELECT `chat_application_chats`.* FROM `chat_application_chats` WHERE `chat_application_chats`.`id` = 1 LIMIT 1
UPDATE `chat_applications` SET `chat_applications`.`chat_application_chats_count` = COALESCE(`chat_applications`.`chat_application_chats_count`, 0) + 1 WHERE `chat_applications`.`id` = 1