chat/app/models/chat_application.rb

SELECT 1 AS one FROM `chat_applications` WHERE `chat_applications`.`token` = 'dd8b41efb9e39262d61e7634b65ae8df' LIMIT 1
---
  def generate_token
    self.token = SecureRandom.hex(16) while token.blank? || ChatApplication.exists?(token: token)