chat/app/models/chat_application_chat.rb

  def set_number
    self.number = (chat_application.chat_application_chats.maximum(:number) || 0) + 1
---
SELECT MAX(`chat_application_chats`.`number`) FROM `chat_application_chats` WHERE `chat_application_chats`.`chat_application_id` = 1