chat/app/models/chat_application_message.rb

  def set_number
    self.number = (chat_application_chat.chat_application_messages.maximum(:number) || 0) + 1
---
SELECT MAX(`chat_application_messages`.`number`) FROM `chat_application_messages` WHERE `chat_application_messages`.`chat_application_chat_id` = 1