chat/app/services/ChatSystemServer.rb

INSERT INTO `chat_applications` (`name`, `token`, `chat_application_chats_count`, `created_at`, `updated_at`) VALUES ('app1', 'c3d504c12f82ff6c074e167be49a69cf', NULL, '2024-07-05 21:00:30.310117', '2024-07-05 21:00:30.310117')
---
  def create_application(create_application_req, _unused_call)
    app = ChatApplication.create!(name: create_application_req.name)

SELECT `chat_applications`.* FROM `chat_applications` WHERE `chat_applications`.`token` = '62dfff7b02960f43ff43f09339e79b61' LIMIT 1
UPDATE `chat_applications` SET `chat_applications`.`name` = 'app1-updated', `chat_applications`.`updated_at` = '2024-07-05 18:45:23.890868' WHERE `chat_applications`.`id` = 2
---
  def update_application(update_application_req, _unused_call)
    app = ChatApplication.find_by!(token: update_application_req.token)
    app.update!(name: update_application_req.name)

SELECT `chat_applications`.* FROM `chat_applications` WHERE `chat_applications`.`token` = '62dfff7b02960f43ff43f09339e79b61' LIMIT 1
---
  def get_application(get_application_req, _unused_call)
    app = ChatApplication.find_by!(token: get_application_req.token)

SELECT `chat_applications`.* FROM `chat_applications` WHERE `chat_applications`.`token` = 'dd8b41efb9e39262d61e7634b65ae8df' LIMIT 1
INSERT INTO `chat_application_chats` (`chat_application_id`, `number`, `chat_application_messages_count`, `created_at`, `updated_at`) VALUES (1, 1, NULL, '2024-07-06 20:00:20.711185', '2024-07-06 20:00:20.711185')
---
  def create_chat(create_chat_req, _unused_call)
    app = ChatApplication.find_by!(token: create_chat_req.application_token)
    chat = app.chat_application_chats.create!

SELECT `chat_applications`.* FROM `chat_applications` WHERE `chat_applications`.`token` = 'dd8b41efb9e39262d61e7634b65ae8df' LIMIT 1
SELECT `chat_application_chats`.* FROM `chat_application_chats` WHERE `chat_application_chats`.`chat_application_id` = 1
SELECT `chat_applications`.* FROM `chat_applications` WHERE `chat_applications`.`token` = 'f6b1bfeffcdbd257635400505da5da04' LIMIT 1
---
  def get_chats(get_chats_req, _unused_call)
    app = ChatApplication.find_by!(token: get_chats_req.application_token)
    chats = app.chat_application_chats.map do |chat|

SELECT `chat_applications`.* FROM `chat_applications` WHERE `chat_applications`.`token` = '63cf194ca44acffd765b25121290ec20' LIMIT 1
SELECT `chat_application_chats`.* FROM `chat_application_chats` WHERE `chat_application_chats`.`chat_application_id` = 1 AND `chat_application_chats`.`number` = 1 LIMIT 1
INSERT INTO `chat_application_messages` (`chat_application_chat_id`, `number`, `body`, `created_at`, `updated_at`) VALUES (1, 1, 'hello world from ruby on rails', '2024-07-06 20:00:50.430272', '2024-07-06 20:00:50.430272')
---
  def create_message(create_message_req, _unused_call)
    app = ChatApplication.find_by!(token: create_message_req.application_token)
    chat = app.chat_application_chats.find_by!(number: create_message_req.chat_number)
    message = chat.chat_application_messages.create!(body: create_message_req.body)

SELECT `chat_applications`.* FROM `chat_applications` WHERE `chat_applications`.`token` = '45da70007791b0156b1203ca99d6271f' LIMIT 1
SELECT `chat_application_messages`.* FROM `chat_application_messages` WHERE `chat_application_messages`.`chat_application_chat_id` = 1
SELECT `chat_application_chats`.* FROM `chat_application_chats` WHERE `chat_application_chats`.`chat_application_id` = 1 AND `chat_application_chats`.`number` = 1 LIMIT 1
---
  def get_messages(get_messages_req, _unused_call)
    app = ChatApplication.find_by!(token: get_messages_req.application_token)
    chat = app.chat_application_chats.find_by!(number: get_messages_req.chat_number)
    messages = chat.chat_application_messages.map do |message|

SELECT `chat_applications`.* FROM `chat_applications` WHERE `chat_applications`.`token` = '63cf194ca44acffd765b25121290ec20' LIMIT 1
SELECT `chat_application_chats`.* FROM `chat_application_chats` WHERE `chat_application_chats`.`chat_application_id` = 1 AND `chat_application_chats`.`number` = 1 LIMIT 1
SELECT `chat_applications`.* FROM `chat_applications` WHERE `chat_applications`.`token` = '45da70007791b0156b1203ca99d6271f' LIMIT 1
---
  def search_messages(search_messages_req, _unused_call)
    app = ChatApplication.find_by!(token: search_messages_req.application_token)
    chat = app.chat_application_chats.find_by!(number: search_messages_req.chat_number)
    results = ChatApplicationMessage.search(search_messages_req.query, chat.id)